update nmp package publishing and docs (#397)
* update auth doc

Signed-off-by: Adam Pingel <oss@pingel.org>

* build/publish @semiont/content

Signed-off-by: Adam Pingel <oss@pingel.org>

* update packages docs

Signed-off-by: Adam Pingel <oss@pingel.org>

* update docs to reflect the orientation around packages

Signed-off-by: Adam Pingel <oss@pingel.org>

---------

Signed-off-by: Adam Pingel <oss@pingel.org>
